#============================================================
import random
#============================================================
from FlexMessage import *
#============================================================
#進行計算
def Capsule_Cul():
    return Capsule_Gotcha()

def Ordinary_Draw():
    SLIVER = {
        1  : ["碧"],
        2  : ["步未"],
        3  : ["日和"],
        4  : ["優衣"],
        5  : ["怜"],
        6  : ["依里"],
        7  : ["胡桃"],
        8  : ["鈴莓"],
        9  : ["優花梨"],
        10 : ["美咲"],
        11 : ["莉瑪"]
    }
    GOLDEN = {
        1  : ["小雪"],
        2  : ["宮子"],
        3  : ["茜里"],
        4  : ["美美"],
        5  : ["香織"],
        6  : ["鈴奈"],
        7  : ["美里"],
        8  : ["七七香"],
        9  : ["鈴"],
        10 : ["綾音"],
        11 : ["紡希"],
        12 : ["深月"],
        13 : ["美冬"],
        14 : ["珠希"],
        15 : ["空花"],
        16 : ["千歌"],
        17 : ["真陽"],
        18 : ["忍"],
        19 : ["惠理子"],
        20 : ["栞"],
        21 : ["茉莉"]
    }
    COLOUR = {
        1  : ["杏奈"],
        2  : ["真步"],
        3  : ["璃乃"],
        4  : ["初音"],
        5  : ["霞"],
        6  : ["伊緒"],
        7  : ["咲戀"],
        8  : ["小望"],
        9  : ["妮諾"],
        10 : ["秋乃"],
        11 : ["鏡華"],
        12 : ["智"],
        13 : ["真琴"],
        14 : ["伊莉亞"],
        15 : ["嘉夜"],
        16 : ["純"],
        17 : ["靜流"],
        18 : ["莫妮卡"],
        19 : ["流夏"],
        20 : ["吉塔"],
        21 : ["亞里莎"],
        22 : ["安"],
        23 : ["古蕾雅"],
        24 : ["江戶空花"],
        25 : ["江戶妮諾"],
        26 : ["學院碧"],
        27 : ["克蘿依"],
        28 : ["優妮"],
        29 : ["萬聖美美"],
        30 : ["露娜"],
        31 : ["魔法少女霞"],
        32 : ["遊俠鈴"],
    }
    for i in range (0,10):
        flag = random.randint(1,1000)
        if(i!=9):
            if(flag<=25):
                print("彩，"+ COLOUR[random.randint(1,len(COLOUR))][0])
            elif(flag<=205):
                print("金，"+ GOLDEN[random.randint(1,len(GOLDEN))][0])
            else:
                print("銀，"+ SLIVER[random.randint(1,len(SLIVER))][0])
        else:
            if(flag<=25):
                print("彩，"+ COLOUR[random.randint(1,len(COLOUR))][0])
            else:
                print("金，"+ GOLDEN[random.randint(1,len(GOLDEN))][0])
#Ordinary_Draw()